let handbook = {
    menu: [
        {
            name: 'Своп контракты',
            children: [
                {name: 'Руководство для новичков', url: '/direct', mark: 'swapContractsGuide'},
                {name: 'Описание цифровых контрактов', url: '/handbook/instructions#text', mark: '#text'},
                {name: 'Что такое цифровые контракты', url: '/handbook/instructions#text1', mark: '#text1'},
                {name: 'Как торговать цифровыми контрактами', url: '/handbook/instructions#text2', mark: '#text2'},
                {name: 'Механизм управления рисками', url: '/handbook/instructions#text3', mark: '#text3'},
                {name: 'Механизм маркировки справедливой цены', url: '/handbook/instructions#text4', mark: '#text4'},
                {name: 'Фиксированная спотовая цена - финансирование', url: '/handbook/instructions#text5', mark: '#text5'},
                {name: 'История финансирования', url: '/handbook/compensate/1', mark: 'compensate'},
                {name: 'История страхового фонда', url: '/handbook/insurance/1', mark: 'insurance'},
            ]
        },
        {
            name: 'Своп контракты',
            children: [
                {name: 'Словарь', url: '/handbook/nounExplanation', mark: 'nounExplanation'},
                {name: 'Индексная цена', url: '/handbook/price/1', mark: 'price'}
            ]
        }
    ],
    instructions: {
        title: 'Руководство по Своп контрактам',
        paragraph1: {
            title: 'Описание контрактов：',
            p1: 'Предметом договора является цифровая валюта.Для того, чтобы облегчить транзакции, соответствующие торговые единицы каждой цифровой валюты были скорректированы, см. таблицу:',
            p2: 'Примечание: Комиссия мэйкера и тэйкера, за обработку, может подвергаться нерегулярной корректировке из-за действий платформы. Конкретная информация зависит от информации в объявлениях.'
        },
        theadList: ['Наименование', 'BTC', 'EOS', 'BCH', 'ETH', 'LTC', 'XRP', 'ETC', 'DASH'],
        tbodyList: [
            ['Константа', '1', '1', '1', '1', '1', '1', '1', '1'],
                ['Котировка', 'USD', 'USD', 'USD', 'USD', 'USD', 'USD', 'USD', 'USD'],
                ['Стоимость контракта', '1USD/BTCUSD', '1USD/EOSUSD', '1USD/BCHUSD', '1USD/ETHUSD', '1USD/LTCUSD', '1USD/LTCUSD', '1USD/LTCUSD', '1USD/DASHUSD'],
                ['Способ оплаты', 'T+0', 'T+0', 'T+0', 'T+0', 'T+0', 'T+0', 'T+0', 'T+0'],
                ['Время', '24H', '24H', '24H', '24H', '24H', '24H', '24H', '24H'],
                ['Коэффициент маржи', '0.5%', '0.5%', '0.5%', '0.5%', '0.5%', '0.5%', '0.5%', '0.5%'],
                ['мэйкер', '0.03%', '0.03%', '0.03%', '0.03%', '0.03%', '0.03%', '0.03%', '0.03%'],
                ['тэйкер', '0.06%', '0.06%', '0.06%', '0.06%', '0.06%', '0.06%', '0.06%', '0.06%']
            ],
            text1: 'Что такое Своп контракт',
    paragraph2: {
    p1: 'Бессрочный контракт - это цифровой валютный договор, в котором валюта является единицей оценки и расчетной единицы. В отличие от фьючерсных контрактов, у Бессрочного контракта нет даты истечения срока действия, поэтому никакого клиринга не произойдет. Текущие бессрочные контракты поддерживают двустороннюю торговлю такими контрактами, как BTCUSD и EOSUSD, и предоставляет множество рычагов, позволяющих копировать спотовый рынок под высоким кредитным плечом. В бессрочных контрактах нет расчета, а следить за индексированной ценой ссылки можно с помощью механизма привязки. <a href="/handbook/price/1" style="color: #597ab9;"></a>。'
},
text2: 'Как совершать своп контракты?',
    paragraph3: {
    p1: 'Стоимость бессрочного контракта：',
        p2: 'Индексная цена бессрочного контракта - это текущий индекс многих головных бирж. Для получения дополнительной информации см.<a href="/handbook/price/1" style="color: #597ab9;">индексную цену.</a>。Вся маржа, прибыль и убыток выражены в валюте держателя.Единица сделки поясняется <a href="#text" style="color: #597ab9;">со ссылкой на контракт</a>。',
        p3: 'Цифровая валюта на перевод/инвесторы, которые получают выгоду за счет роста долларовых цен, могут совершать своп длинных позиций. И наоборот, если цена падает, то своп коротких позиций.',
        p4: 'Маржа и кредитное плечо：',
        p5: 'Вся маржа рассчитывается в валюте открытых позиций,  вы можете совершать двусторонние торги, покупать лонги или продавать шорты.',
        p6: 'Кредитные рычаги: 2Х, 3Х, 5Х, 10Х, 20Х, 33Х, 50Х, 100Х. Вы можете выбрать, какой рычаг использовать при открытии позиции, но рычаг нельзя отрегулировать дважды после открытия позиции. (Рычаги между несколькими контрактами не влияют друг на друга). ',
        p7: 'Пример:',
        p8: 'Инвестор открывает лонг 100 BTC или др. Эквивалент биткойна, цена 6000 долларов США, он открыл лонг 100BTC * 6,000 USD = 600 000 контрактов, контрактная цена выросла до 7 000 долларов США за несколько дней.',
        p9: 'Прибыль инвестора состовляет: 600,000 * 1 * (1/6,000 - 1/7,000) = 14.286 BTC',
        p10: 'Если цена фактически упала до 5000$, убыток инвестора состовляет: 600,000 * 1 * (1/6,000-1/5,000) =-20 BTC。Потеря также велика из-за взаимности контракта и свойства линейности. ',
        p11: 'И наоборот, для инвесторов открывающих лонг позиции, в случае биткойна, падающая прибыль будет больше, чем потери, вызванные тем же увеличением.',
        p12: 'Примечание: чем выше плечо, тем больше влияние колебаний цен. Выберите подходящий рычаг для торгов в пределах вашего допустимого предела.'
},
text3: 'Механизм управления рисками',
    paragraph4: {
    p1: 'Механизм ликцидации цен',
        p2: 'В управлении рисками бессрочных контрактов используется механизм ликвидации цен, а цена ликвидации рассчитывается на основе цены индекса. Когда цена достигает уровня ликвидации, она переходит в процесс ликвидации.',
        p3: 'Определение цены ликвидации：',
        p4: 'Требуемая маржа для всех открытых позиций =  (MM * кол-во контрактов * множитель/ цена открытия позиции) ',
        p5: 'Это минимальная маржа, необходимая для поддержания позиции. Если она ниже этой суммы, ваша позиция будет ликвидирована. Исходя из этого значения, мы вычисляем цену ликвидации.',
        p6: 'Где, MM = минимальная маржа = 0,5%.',
        p7: 'Процесс ликвидации',
        p8: 'Для того, чтобы не допустить ненужных ликвидаций, мы используем процесс частичной ликвидации, который включает в себя автоматическое сокращение поддерживающей маржи, чтобы избежать полной ликвидации позиции.',
        p9: 'Если в настоящее время, требования по марже обслуживания не выполняются, эта позиция войдет в процесс ликвидации и будет принудительно закрыта по цене банкротства.',
        p10: 'Если в процессе ликвидации, получили позицию с более выгодной ценой, чем цена банкротства, то дополнительные средства будут добавлены в <a href="/handbook/insurance/1" style="color: #597ab9;">страховой фонд.</a>',
        p11: 'Если в процессе ликвидации, ликвидация по цене банкротства по-прежнему не соответствует условиям закрытия позиции, то мы будем исплозовать средства со страхового фонда, для продолжения выполнения операции закрытия ордера на рынке. Если по-прежнему невозможно совершить клиринг ордера, то это приведет кавто-делевериджингу.',
        p12: 'Если возникнет ликвидация позиции, вы будете оповещены.',
        p13: 'Авто-делевериджинг',
        p14: 'ADL нацелен на обработку позиций, которые не могут быть ликвидированы к тому моменту, когда рыночная цена достигает уровня цены банкротства, ADL автоматически закрывает рыночные позиции трейдеров на основании приоритета с учетом размера прибыли и величины кредитного плеча.',
        p15: 'Согласно рыночным принципам, транзакция обязательно должна быть с контрагентом. Если контрагент исчезает (недоступен на рынке), количество позиций контрагента на рынке тоже будет соответственно уменьшаться.',
        p16: 'Примечание: влияет лишь на этот вид контрактов, позиции других контрактов влиянию не подвергаются.',
        p17: 'Ранжирование Авто-делевериджинга: Приоритетность делевериджинга определяется на основе величины прибыли и кредитного плеча. В первую очередь закрываются позиции трейдеров с более высокой прибыльностью и кредитным плечом.',
        p18: 'Расчет ранжирования: ',
        p19: 'Порядок = Процентное соотношение прибыли и убытков (PNL) * Эффективный леверидж (если есть прибыль) =Процентное соотношение прибыли и убытков (PNL) /Эффективный леверидж (при убытках)',
        p20: 'также, ',
        p21: 'Эффективный леверидж= abs (Значение маркировки)/( Значение маркировки– цена банкротства) ',
        p22: 'Процент PNL = (Значение маркировки– среднее значение входа)/ (средняя стоимость входа)',
        p23: 'Значение маркировки= стоимость позиции по цене маркировки',
        p24: 'Цена банкротства = стоимость позиции по цене банкротства',
        p25: 'Средняя стоимость входа = Стоимость позиции по средней цене входа',
        p26: 'Система разделяет такие рыночные позиции на длинные и короткие и ранжирует их от более высоких к более низким.',
        p27: 'При Авто-делевериджинге, вы будете оповещены.'
},
text4: 'Механизм Маркировки справедливой цены',
    paragraph5: {
    p1: 'Для того, чтобы избежать искусственного контроля, возникшее в результате цепной реакции ликвидации позиций, которые могут повлеч неоправданные потери для клиента. Платформа фиксирует рыночную цену путем привязки индексной цены и использует маркировку справедливо	 цены в качестве расчетной цены прибыли и убытков, вместо цены платформы.',
        p2: 'Определение маркировки справедливой цены: маркировка справедливой цены= индексная цена *( 1 +базис финансирования)',
        p3: 'Для расчета базиса финансирования, пожалуйста, обратитесь к<a href="#text5" style="color: #597ab9;">цене привязки</a>',
        p4: 'В ходе транзакции сделка осуществляется в соответствии с ценой платформы. (Процесс открытия и закрытия должен быть сформирован контрагентом платформы).',
        p5: 'Расчет нереализованного PNL основан на маркировке справедливой цены, поэтому вы можете быстро увидеть прибыль и убыток в момент открытия позиции (это результат маркировки справедливой цены). Поскольку ваш расчет позиции совершается на основе маркировки справедливой цены, независимо от волатильности платформы, если справедливая цена (примечание: справедливая цена) не изменилась, то нереализованный PNL не изменится. Во избежание «ликвидации».',
        p6: 'Например:на платформе текущая цена BTCUSD составляет 7000, справедливая цена - 7005, открывая позицию, начинать торги можете только с 7000, но ваши нереализованный PNL  будет рассчитан в соответствии с 7005.',
        p7: 'Если в следующий момент,  на платформе цена, по какой-то причине, изменяется до 6000, а справедливая цена по-прежнему равна 7005 (справедливая цена не меняется), то ваш нереализованный PNL по-прежнему рассчитываются в соответствии с 7005,  изменение цены на платформе не оказывает никакого влияние. Однако, если на тот момент, вы закрываете позицию, цена сделки составит 6000, потому что цена, во время транзакции, генерируется только с реальным контрагентом.'
},
text5: 'Фиксированная спотовая цена - финансирование',
    paragraph6: {
    p1: 'Основными активами бессрочного контракта являются спотовые активы цифровых валют, таких как BTC. Чтобы поддерживать цену платформы в соответствии с текущей ссылочной ценой, мы используем механизм финансирования как механизм фиксации спот-цены.',
        p2: 'Дополнительная комиссия за финансирование не взимается; обмен платежами происходит напрямую между участниками торгового процесса',
        p3: 'Ставка финансирования формируется из двух основных компонентов: процентной ставки и премии/дисконта, Финансирование происходит три раза в 08:00 (UTC), 16:00 (UTC) и 24:00 (UTC).',
        p4: 'Размер финансирования рассчитывается следующим образом:',
        p5: 'Ставка финансирования состоит из двух основных компонентов: процентной ставки и премии/дисконта.',
        p6: 'Компонент процентной ставки:',
        p7: 'Все контракты, которые торгуются на BitMEX, состоят из двух инструментов: базовой валюты и котируемой валюты. Процентная ставка зависит от разницы процентных ставок между двумя валютами:',
        p8: 'Компонент премии/дисконта:',
        p9: 'Бессрочный контракт может торговаться со значительной премией (положительной разницей) или дисконтом (отрицательной разницей) по отношению к цене маркировки. В подобных ситуациях для того, чтобы ставка финансирования отражала последние уровни цен контракта, используется индекс премиума.',
        p10: 'Индекс премиума (P) = (Max(0, значимая цена покупки – цена маркировки) - Max(0, цена маркировки – значимая цена продажи)) /спотовая цена + справедливый базис, используемый в цене маркировки',
        p11: 'Расчет окончательной ставки финансирования',
        p12: 'Ставка финансирования рассчитывается с учетом 8-часового компонента процентной ставки и с учетом 8-часового компонента премии/дисконта. При этом добавляется компенсатор, равный +/-0,05%.',
        p13: 'Ставка финансирования (F) = индекс премиума (P) + clamp(процентная ставка (I) – индекс премиума (P), 0,05%, -0,05%)',
        p14: 'Рассчитанная ставка финансирования затем применяется к открытой позиции, чтобы установить, какая сумма финансирования должна быть списана или зачислена при наступлении временной метки.',
        p15: 'Предельные ставки финансирования',
        p16: 'Мы устанавили ограничения на ставку финансирования, чтобы гарантировать использование максимального кредитного плеча. С этой целью налагаются два ограничения:',
        p17: '1. Абсолютная ставка финансирования не может превышать 75% от разницы между начальной маржей и поддерживающей маржей. Если начальная маржа равна 1%, а поддерживающая маржа равна 0,5%, максимальная ставка финансирования составит 75% * (1% - 0,5%) = 0,375%.',
        p18: '2. Ставка финансирования не может превышать 75% от поддерживающей маржи между интервалами финансирования.'
}
},
compensate: {
    title: 'Ставка финансирования',
        paragraph1: {
        title: 'Описание своп контрактов：',
            p1: 'Ставка финансирования обменивается между пользователями, занимающими позиции, и платформа не взимает никаких комиссий.',
            p2: 'Ставка финансирования формируется из двух основных компонентов: процентной ставки и премии/дисконта, Финансирование происходит три раза в 08:00 (UTC), 16:00 (UTC) и 24:00 (UTC).',
            p3: 'Комиссия финансирования=стоимость позиции*ставка финансирования',
            p4: 'см.<a  style="color: #597ab9;">“Фиксированная спотовая цена”</a>'
    },
    theadList: ['Время', 'ставка финансирования']
},
insurance: {
    title: 'Страховой фонд',
        paragraph1: {
        title: 'Страховой фонд',
            p1: 'Страховой фонд - это управление остаточной стоимостью ликвидируемого заказа после обработки рыночного заказа. Если на момент ликвидации заказ не удалось выполнить, страховой фонд будет добавлен для поддержания ордера.',
            p2: 'Страховой фонд может увеличиваться или уменьшаться в зависимости от ситуации с транзакцией клиента, а накопление и использование страхового фонда происходит при ADL.'
    },
    theadList: ['Время', 'Остаток']
},
noun: {
    title: 'Словарь',
        paragraph1: {
        title: 'Страховой фонд',
            p1: 'Двусторонняя котировка：Двусторонняя котировка- это объявление одновременно цены продажи (Bid) и цены покупки (Ask), то есть дилер готов как покупать, так и продавать валюту или ценную бумагу.',
            p2: 'Маржа：Средства клиента, находящиеся у брокера в качестве залога для поддержания открытой позиции или позиции, которую клиент намерен открыть. По каждому инструменту определяется своя маржа',
            p3: 'Нереализованный PNL：Текущая прибыль и убытки, приходящиеся на все открытые позиции.',
            p4: 'Единица транзакции：Минимальное значение транзакции рассчитывается как «шт», в настоящее время 1шт = 1 доллар США.',
            p5: 'Ставка финанскирования：Для того, чтобы зафиксировать спот цену, производится корректировка финансирования между длинными и короткими позициями. Дополнительная комиссия за финансирование не взимается; обмен платежами происходит напрямую между участниками торгового процесса.',
            p6: 'Ставка финансирования формируется из двух основных компонентов: процентной ставки и премии/дисконта, Финансирование происходит три раза в 08:00 (UTC), 16:00 (UTC) и 24:00 (UTC). ',
            p7: 'Минимальная цена изменения：Это относится к минимальной стоимости изменения котируемой цены за единицу измерения в процессе открытых торгов биржи. В транзакции минимальное значение изменения каждой котировки должно быть кратным целому ряду минимальной цены изменения.',
            p8: 'Поддерживающая маржа：Минимальное количество средств на счете, необходимое для открытия позиции, и минимальный капитал, необходимый для того, чтобы позиция не была ликвидирована.',
            p9: 'Маркировка справедливой цены：Маркировка справедливой цены= индексная цена *( 1 +базис финансирования)',
            p10: 'Рыночная цена：Заказ на немедленную сделку по текущей рыночной цене. Вместо того, чтобы указывать конкретную цену, вам необходимо заключить сделку по лучшей цене, доступной на рынке в то время.',
            p11: 'Цена открытия：Цена на момент открытия позиции。',
            p12: 'Индексная цена：индекс отслеживает спот-цену, которая берется у Bitfinex, Bitstamp, GDAX и других головных бирж и представляет общий уровень цен на рынке.',
            p13: 'Лимитированный приказ： Открытие сделки по цене, более выгодной, чем текущая. При размещении лимитного ордера вы должны указать конкретную цену.',
            p14: 'Стоимость позиции：Количество заключенных контрактов (количество цифровых валют).',
            p15: 'Отложенный ордер：Приказ от клиента брокеру относительно покупки или продажи валюты при первом достижении ценой необходимого для клиента уровня. Отложенные ордера выставляются минимум на расстоянии спреда от текущей цены, однако разные брокеры часто предлагают свои условия выставления отложенных ордеров. Отложенный ордер не гарантирует сделку.',
            p16: 'Доступная сумма：Это сумма денежных средств на счете, которая доступнадля открытия новых позиций и перевода средств, не включая фиксированную маржу.',
            p17: 'Комиссия за размещение позиции：нет',
            p18: 'Активы пользователя：Все средства пользователя, включая доступный баланс и фиксированную маржу.',
            p19: 'Страховой фонд：Бессрочные контракты 58COIN использует страховой фонд для предотвращения авто-делевериджинга. Фонд используется для повышения цены неисполненных ликвидированных ордеров, чтобы они не были подвержены механизму авто-делевериджинга. Увеличение суммы страховой фонда происходит от цены ликвидированного ордера на рынке, превышающей цену банкротства.'
    },
},
price: {
    title: 'Индексная цена',
        paragraph1: {
        p1: 'Описание',
            p2: 'Индекс отслеживает спотовые цены на частоте одной минуты. В расчете цены используется итоговая цена индекса 58 Swap. Цена индекса отображается в верхней части многих страниц в качестве текущей цены биткойнов.',
            p3: 'Индекс использует тот же взвешенный индекс трех бирж Binance（40%），Huobi (30%) и BitFinex (30%) в ценах на биткойновский доллар (BTC / USD).',
            p4: 'Индекс представляет собой составной индекс, что означает, что цены берутся с нескольких платформ. Информацию о компонетах платформы см. в «распределение составного индекса». Если платформа вышла из строя и транзакции не были опубликованы более 15 минут, мы автоматически удалим компонент из индекса до тех пор, пока транзакции не возобновятся.'
    },
    theadList: ['Время', 'сделки', 'Индекс цены'],
}

}
export default handbook
